{
  "basics": {
    "email": "tjtolton@gmail.com",
    "phone": "(717) 781-6668",
    "name": "Tyler Tolton",
    "summary": "Experienced builder of distributed systems, asynchronous applications, and stable, blinding fast code.  Believes that a good engineering team's core values are Customer Satisfaction, Cadence, and Learning.",
    "label": "Serverless Full Stack Software Engineer",
    "picture": "",
    "website": "http://tylertolton.com",
    "profiles": [
      {
        "username": "Defunctionalize",
        "url": "http://github.com/Defunctionalize",
        "network": "Github"
      }
    ],
    "location": {
      "address": "1290 Country Club Road",
      "city": "York",
      "region": "Pennsylvania",
      "postalCode": "17403",
      "countryCode": "US"
    }
  },
  "volunteer": [
    {
      "highlights": [],
      "startDate": "2012-03-20",
      "organization": "York Literacy Council",
      "summary": "One on one literacy tutoring for adults in my home city.",
      "endDate": "2013-06-01",
      "website": "http://www.yorkliteracy.org/public/",
      "position": "Volunteer GED/ESL Tutor"
    }
  ],
  "work": [
    {
      "endDate": "2019-07-13",
      "highlights": [
        "Authored full suite of 26 AWS Lambda serverless microservices in nodejs, python, and Rust",
        "Directly engaged in external sales process - qualifying leads, attending tradeshows, fielding late stage tech implementation calls",
        "Wrote mobile optimised browser client for Ethereum blockchain smart contract using Web3, Ethers.js, Geth, Metamask, Coinbase Wallet",
        "used AWS APPSync to synchronize blockchain activity with customer admin panel and reporting tool",
        "Enabled real-time content editing and chat for customer data using AWS serverless websocket API",
        "Designed and implemented secure single-use \"magiclink\" email-based auth using Lambda, DynamoDB, and SES",
        "Synchronized business data between Salesforce source of truth and DynamoDB operational store",
        "Deployed and managed secure hosting of 11 custom web apps on AWS Cloudfront CDN backed by S3 static site hosting",
        "Administrated marketing wordpress website hosting on Elastic Beanstalk featuring secure salesforce connection for lead capture"
      ],
      "startDate": "2018-09-25",
      "summary": "Nth Round is an NEA backed startup that aims to provide a blockchain-powered secure marketplace for the resale of private equity among its clients' shareholders.",
      "position": "Chief Architect",
      "company": "Nth Round, Inc."
    },
    {
      "endDate": "2018-06-01",
      "highlights": [
        "In charge of drafting, publication and distribution of release notes, worked closely with QA, Client Services and Product",
        "Reviewed and released new software to production using “bake” tasks and other bash scripts which I maintained",
        "Oversaw smoke testing of newly released code in production environment",
        "Oversaw biweekly software releases: and drew up release notes for Client Services/Sales",
        "AWS S3 based SFTP platform for 39 clients, used for triggering automated reports from Looker",
        "Ran Jupyter based feature demos to internal product strategy teams, sales, and client relationship teams",
        "Containerized 14 service system for rapid local development, images tagged and stored on AWS: ECR",
        "Architected document versioning and archive retrieval system for client defined data.",
        "AWS S3 based SFTP platform for 39 clients, used for triggering automated reports from Looker",
        "Implemented Jenkins based continuous integration pipeline for 6 Clojure, 2 Ansible, 3 Node service"
      ],
      "startDate": "2016-09-01",
      "summary": "",
      "position": "Senior Full Stack Developer",
      "company": "Relay Network, LLC."
    },
    {
      "endDate": "2016-02-01",
      "highlights": [
        "Created Distributed Scheduler API using redis/couchbase",
        "Led daily standups with 8 person team focused horizontal delivery of apps to bank-wide users.",
        "Created Event Management AI agent to evaluate and dispatch calculation jobs based company need",
        "Guided product execution team to new web migration strategy",
        "Provided strategic training to collaborating teams on new web migration strategy",
        "Interfaced daily with customers to support software products"
      ],
      "startDate": "2016-02-01",
      "summary": "The Saber2 dev team was an internal development task force charged with modernizing and replacing Bank of America's capital reporting platform, Saber",
      "position": "Senior Applications Developer",
      "company": "Bank of America"
    },
    {
      "endDate": "2016-01-01",
      "highlights": [
        "Architected reporting event emission pipeline",
        "Architected and implemented a GUI based, JSON driven cloud automation framework “BotFactory” - scale tested for use with General Electric cloud computing.",
        "Designed unit test implementation strategy around 3 year old legacy code base cloud harvesting engine",
        "Created cloud testing framework tools for use with multiple asynchronous python processes",
        "Designed Clojure based microservice replacement architecture for use with cloud harvesting service.",
        "Designed a cloud simulation engine using jinja2 templating and XML responses in combination with a flask server."
      ],
      "startDate": "2015-04-01",
      "summary": "",
      "position": "Senior Backend Python Developer",
      "company": "Divvy Cloud"
    },
    {
      "endDate": "2015-02-01",
      "highlights": [
        "Created User Controls and complex animations using JavaScript and Python Kivy",
        "Unit testing using Pycharm Integrated nosetests and coverage, using Mock when needed.",
        "Developed Login and Account creation feature for Android.",
        "Developed a data migration feature using GZ File Compression and AES 256 encryption.",
        "Modified CSS in order to provide cross-browser integration.",
        "Manipulated JavaScript & jquery code to enhance user functionality with new website.",
        "Develop table less, W3C compliant web sites using CSS, XHTML, Javascript, jQuery and Python."
      ],
      "startDate": "2014-03-01",
      "position": "Python Developer",
      "company": "Freelance"
    },
    {
      "endDate": "2013-02-01",
      "highlights": [
        "Implemented LSFR algorithm to generate unique shortcodes for SMS messaging",
        "Architected robustness system for notifications when SMS carrier is unavailable",
        "Designed and implemented migration framework using petal - migrated from postgres into couchbase",
        "Started developing web applications with Django 1.4 to  1.7",
        "Successfully migrated the Django database from SQLite to MySQL with complete data integrity.",
        "AJAX with jQuery"
      ],
      "startDate": "2011-12-01",
      "position": "Python/Django/SQL Site Builder",
      "company": "Independent Contractor -- Friends and Family"
    }
  ],
  "publications": [],
  "references": [
    {
      "name": "Richard Mugge",
      "reference": "FSE, Integrichain: Worked with me at Relay Network as my immediate manager."
    },
    {
      "name": "Barbara Lewis",
      "reference": "Product Marketer, Nth Round: Worked with me at Relay Network and Nth Round"
    },
    {
      "name": "Stephen Grimes",
      "reference": "FSE II, Amazon Alexa: Worked with me at Relay Network."
    }
  ],
  "skills": [
    {
      "name": "Web Development",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript"
      ],
      "level": "Master"
    }
  ],
  "interests": [
    {
      "name": "Videogame Development",
      "keywords": [
        "Videogames"
      ]
    }
  ],
  "meta": {"theme":  "paper"},
  "education": [
    {
      "institution": "Temple University",
      "courses": [
        "DB1101 - Basic SQL"
      ],
      "startDate": "2011-01-01",
      "studyType": "Bachelor",
      "endDate": "2013-01-01",
      "area": "Accounting"
    }
  ],
  "languages": [
    {
      "fluency": "Native speaker",
      "language": "English"
    }
  ]
}